espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_usart.h
/* Bit fields for USART IEN */
#define _USART_IEN_RESETVALUE                   0x00000000UL                            /**< Default value for USART_IEN                 */
#define _USART_IEN_MASK                         0x0001FFFFUL                            /**< Mask for USART_IEN                          */
#define USART_IEN_TXC                           (0x1UL << 0)                            /**< TX Complete Interrupt Enable                */
#define _USART_IEN_TXC_SHIFT                    0                                       /**< Shift value for USART_TXC                   */
#define _USART_IEN_TXC_MASK                     0x1UL                                   /**< Bit mask for USART_TXC                      */
#define _USART_IEN_TXC_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TXC_DEFAULT                   (_USART_IEN_TXC_DEFAULT << 0)           /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TXBL                          (0x1UL << 1)                            /**< TX Buffer Level Interrupt Enable            */
#define _USART_IEN_TXBL_SHIFT                   1                                       /**< Shift value for USART_TXBL                  */
#define _USART_IEN_TXBL_MASK                    0x2UL                                   /**< Bit mask for USART_TXBL                     */
#define _USART_IEN_TXBL_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TXBL_DEFAULT                  (_USART_IEN_TXBL_DEFAULT << 1)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_RXDATAV                       (0x1UL << 2)                            /**< RX Data Valid Interrupt Enable              */
#define _USART_IEN_RXDATAV_SHIFT                2                                       /**< Shift value for USART_RXDATAV               */
#define _USART_IEN_RXDATAV_MASK                 0x4UL                                   /**< Bit mask for USART_RXDATAV                  */
#define _USART_IEN_RXDATAV_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_RXDATAV_DEFAULT               (_USART_IEN_RXDATAV_DEFAULT << 2)       /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_RXFULL                        (0x1UL << 3)                            /**< RX Buffer Full Interrupt Enable             */
#define _USART_IEN_RXFULL_SHIFT                 3                                       /**< Shift value for USART_RXFULL                */
#define _USART_IEN_RXFULL_MASK                  0x8UL                                   /**< Bit mask for USART_RXFULL                   */
#define _USART_IEN_RXFULL_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_RXFULL_DEFAULT                (_USART_IEN_RXFULL_DEFAULT << 3)        /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_RXOF                          (0x1UL << 4)                            /**< RX Overflow Interrupt Enable                */
#define _USART_IEN_RXOF_SHIFT                   4                                       /**< Shift value for USART_RXOF                  */
#define _USART_IEN_RXOF_MASK                    0x10UL                                  /**< Bit mask for USART_RXOF                     */
#define _USART_IEN_RXOF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_RXOF_DEFAULT                  (_USART_IEN_RXOF_DEFAULT << 4)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_RXUF                          (0x1UL << 5)                            /**< RX Underflow Interrupt Enable               */
#define _USART_IEN_RXUF_SHIFT                   5                                       /**< Shift value for USART_RXUF                  */
#define _USART_IEN_RXUF_MASK                    0x20UL                                  /**< Bit mask for USART_RXUF                     */
#define _USART_IEN_RXUF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_RXUF_DEFAULT                  (_USART_IEN_RXUF_DEFAULT << 5)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TXOF                          (0x1UL << 6)                            /**< TX Overflow Interrupt Enable                */
#define _USART_IEN_TXOF_SHIFT                   6                                       /**< Shift value for USART_TXOF                  */
#define _USART_IEN_TXOF_MASK                    0x40UL                                  /**< Bit mask for USART_TXOF                     */
#define _USART_IEN_TXOF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TXOF_DEFAULT                  (_USART_IEN_TXOF_DEFAULT << 6)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TXUF                          (0x1UL << 7)                            /**< TX Underflow Interrupt Enable               */
#define _USART_IEN_TXUF_SHIFT                   7                                       /**< Shift value for USART_TXUF                  */
#define _USART_IEN_TXUF_MASK                    0x80UL                                  /**< Bit mask for USART_TXUF                     */
#define _USART_IEN_TXUF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TXUF_DEFAULT                  (_USART_IEN_TXUF_DEFAULT << 7)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_PERR                          (0x1UL << 8)                            /**< Parity Error Interrupt Enable               */
#define _USART_IEN_PERR_SHIFT                   8                                       /**< Shift value for USART_PERR                  */
#define _USART_IEN_PERR_MASK                    0x100UL                                 /**< Bit mask for USART_PERR                     */
#define _USART_IEN_PERR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_PERR_DEFAULT                  (_USART_IEN_PERR_DEFAULT << 8)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_FERR                          (0x1UL << 9)                            /**< Framing Error Interrupt Enable              */
#define _USART_IEN_FERR_SHIFT                   9                                       /**< Shift value for USART_FERR                  */
#define _USART_IEN_FERR_MASK                    0x200UL                                 /**< Bit mask for USART_FERR                     */
#define _USART_IEN_FERR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_FERR_DEFAULT                  (_USART_IEN_FERR_DEFAULT << 9)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_MPAF                          (0x1UL << 10)                           /**< Multi-Processor Address Frame Interrupt     */
#define _USART_IEN_MPAF_SHIFT                   10                                      /**< Shift value for USART_MPAF                  */
#define _USART_IEN_MPAF_MASK                    0x400UL                                 /**< Bit mask for USART_MPAF                     */
#define _USART_IEN_MPAF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_MPAF_DEFAULT                  (_USART_IEN_MPAF_DEFAULT << 10)         /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_SSM                           (0x1UL << 11)                           /**< Chip-Select In Main Mode Interrupt Flag     */
#define _USART_IEN_SSM_SHIFT                    11                                      /**< Shift value for USART_SSM                   */
#define _USART_IEN_SSM_MASK                     0x800UL                                 /**< Bit mask for USART_SSM                      */
#define _USART_IEN_SSM_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_SSM_DEFAULT                   (_USART_IEN_SSM_DEFAULT << 11)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_CCF                           (0x1UL << 12)                           /**< Collision Check Fail Interrupt Enable       */
#define _USART_IEN_CCF_SHIFT                    12                                      /**< Shift value for USART_CCF                   */
#define _USART_IEN_CCF_MASK                     0x1000UL                                /**< Bit mask for USART_CCF                      */
#define _USART_IEN_CCF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_CCF_DEFAULT                   (_USART_IEN_CCF_DEFAULT << 12)          /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TXIDLE                        (0x1UL << 13)                           /**< TX Idle Interrupt Enable                    */
#define _USART_IEN_TXIDLE_SHIFT                 13                                      /**< Shift value for USART_TXIDLE                */
#define _USART_IEN_TXIDLE_MASK                  0x2000UL                                /**< Bit mask for USART_TXIDLE                   */
#define _USART_IEN_TXIDLE_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TXIDLE_DEFAULT                (_USART_IEN_TXIDLE_DEFAULT << 13)       /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TCMP0                         (0x1UL << 14)                           /**< Timer comparator 0 Interrupt Enable         */
#define _USART_IEN_TCMP0_SHIFT                  14                                      /**< Shift value for USART_TCMP0                 */
#define _USART_IEN_TCMP0_MASK                   0x4000UL                                /**< Bit mask for USART_TCMP0                    */
#define _USART_IEN_TCMP0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TCMP0_DEFAULT                 (_USART_IEN_TCMP0_DEFAULT << 14)        /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TCMP1                         (0x1UL << 15)                           /**< Timer comparator 1 Interrupt Enable         */
#define _USART_IEN_TCMP1_SHIFT                  15                                      /**< Shift value for USART_TCMP1                 */
#define _USART_IEN_TCMP1_MASK                   0x8000UL                                /**< Bit mask for USART_TCMP1                    */
#define _USART_IEN_TCMP1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TCMP1_DEFAULT                 (_USART_IEN_TCMP1_DEFAULT << 15)        /**< Shifted mode DEFAULT for USART_IEN          */
#define USART_IEN_TCMP2                         (0x1UL << 16)                           /**< Timer comparator 2 Interrupt Enable         */
#define _USART_IEN_TCMP2_SHIFT                  16                                      /**< Shift value for USART_TCMP2                 */
#define _USART_IEN_TCMP2_MASK                   0x10000UL                               /**< Bit mask for USART_TCMP2                    */
#define _USART_IEN_TCMP2_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for USART_IEN                  */
#define USART_IEN_TCMP2_DEFAULT                 (_USART_IEN_TCMP2_DEFAULT << 16)        /**< Shifted mode DEFAULT for USART_IEN          */

